app/models/content/header/default.rb

  def generate
    @content.components.tap do |c|
      c.create!(element: image)
      c.create!(element: button)
---
INSERT INTO "element_images" ("src", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["src", "https://upload.wikimedia.org/wikipedia/commons/2/2f/Logo_TV_2015.svg"], ["created_at", "2023-02-19 20:05:40.303113"], ["updated_at", "2023-02-19 20:05:40.303113"]]
INSERT INTO "element_images" ("src", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "element_buttons" ("label", "href", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["label", "Purchase now"], ["href", "https://example.com"], ["created_at", "2023-02-19 20:05:40.314540"], ["updated_at", "2023-02-19 20:05:40.314540"]]

  def button
    options = {
      display: "flex",
      p: "px-8 py-2",
      background: @content.page.defaults["colors"]["primary"],
      color: @content.page.defaults["colors"]["primary_content"],
      items: "items-center"
    }

    Element::Button.create!(label: DEFAULTS[:label], href: DEFAULTS[:href], options: options)
---
INSERT INTO "element_buttons" ("label", "href", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"