app/models/content/hero/alternative.rb

  def generate
    @content.components.tap do |c|
      c.create!(element: h1)
      c.create!(element: h2)
      c.create!(element: button)
---
INSERT INTO "element_h1s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Lorem ipsum dolor sit amet"], ["created_at", "2023-02-19 20:07:46.887073"], ["updated_at", "2023-02-19 20:07:46.887073"]]
INSERT INTO "element_h2s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Lorem ipsum dolor sit amet subtitle"], ["created_at", "2023-02-19 20:07:46.894593"], ["updated_at", "2023-02-19 20:07:46.894593"]]
INSERT INTO "element_h2s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "H1 from hero alternative"], ["created_at", "2023-02-19 19:51:30.839244"], ["updated_at", "2023-02-19 19:51:30.839244"]]
INSERT INTO "element_h1s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "H1 from hero alternative"], ["created_at", "2023-02-19 19:51:30.832912"], ["updated_at", "2023-02-19 19:51:30.832912"]]
INSERT INTO "element_buttons" ("label", "href", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["label", "Purchase now"], ["href", "https://example.com"], ["created_at", "2023-02-19 20:07:46.901989"], ["updated_at", "2023-02-19 20:07:46.901989"]]

  def h1
    options = {
      size: "text-xl",
      color: @content.page.defaults["colors"]["dark_content"],
      font: "font-bold"
    }

    Element::H1.create!(title: DEFAULTS[:h1], options: options)
---
INSERT INTO "element_h1s" ("title", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def h2
    options = {
      size: "text-lg",
      color: @content.page.defaults["colors"]["dark_content"],
      font: "font-semibold"
    }

    Element::H2.create!(title: DEFAULTS[:h2], options: options)
---
INSERT INTO "element_h2s" ("title", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def button
    options = {
      pl: "px-8",
      pt: "py-5",
      background: @content.page.defaults["colors"]["primary_focus"],
      color: @content.page.defaults["colors"]["primary_content"]
    }

    Element::Button.create!(label: DEFAULTS[:label], href: DEFAULTS[:href], options: options)
---
INSERT INTO "element_buttons" ("label", "href", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"