app/models/content/hero/default.rb

INSERT INTO "element_h1s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Lorem ipsum dolor sit amet"], ["created_at", "2023-02-19 20:07:46.847643"], ["updated_at", "2023-02-19 20:07:46.847643"]]
INSERT INTO "element_h2s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Lorem ipsum dolor sit amet subtitle"], ["created_at", "2023-02-19 20:07:46.860222"], ["updated_at", "2023-02-19 20:07:46.860222"]]
INSERT INTO "element_h2s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "H1 amazing subtitle"], ["created_at", "2023-02-19 19:07:28.296766"], ["updated_at", "2023-02-19 19:07:28.296766"]]
INSERT INTO "element_h1s" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "H1 amazing title"], ["created_at", "2023-02-19 19:07:28.281236"], ["updated_at", "2023-02-19 19:07:28.281236"]]
INSERT INTO "element_buttons" ("label", "href", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["label", "Purchase now"], ["href", "https://example.com"], ["created_at", "2023-02-19 20:07:46.868554"], ["updated_at", "2023-02-19 20:07:46.868554"]]
---
  def generate
    @content.components.tap do |c|
      c.create!(element: h1)
      c.create!(element: h2)
      c.create!(element: button)

INSERT INTO "element_h1s" ("title", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def h1
    options = {
      size: "text-xl",
      color: @content.page.defaults["colors"]["primary_content"],
      font: "font-bold"
    }

    Element::H1.create!(title: DEFAULTS[:h1], options: options)

INSERT INTO "element_h2s" ("title", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def h2
    options = {
      size: "text-lg",
      color: @content.page.defaults["colors"]["base_content"],
      font: "font-semibold"
    }

    Element::H2.create!(title: DEFAULTS[:h2], options: options)

INSERT INTO "element_buttons" ("label", "href", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def button
    options = {
      pl: "px-8",
      pt: "py-5",
      background: @content.page.defaults["colors"]["primary"],
      color: @content.page.defaults["colors"]["primary_content"]
    }

    Element::Button.create!(label: DEFAULTS[:label], href: DEFAULTS[:href], options: options)