app/views/pages/show.html.erb

<div class="w-full h-max flex flex-col">
  <% @page.contents.each do |content| %>
---
SELECT "contents".* FROM "contents" WHERE "contents"."page_id" = $1  [["page_id", 1]]