app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @page = Page.includes(contents: [components: :element]).find(params[:id])