app/models/page.rb

INSERT INTO "contents" ("page_id", "content_kind", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def generate
    TEMPLATE.each do |template|
      contents.create(content_kind: template).generate